# 03 Konversi tipe data String ke Numerik pada kolom Data Frame

# Import Modules

In [15]:
import pandas as pd

print(pd.__version__)

1.3.4

# Persiapan Data Frame

In [31]:
data = {'col1':['1', '2', '3', 'teks'],
       'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [9]:
df.dtypes

col1    object
cols    object
dtype: object

In [10]:
## data frame dibuat dengan memanfaatkan dictionary dan list
## cols1 dan cols 2 menjadi nama colomn

# Konversi tipe data dengan fungsi astype ()

In [32]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [33]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [ ]:
## mengkonversi tipe data = colomn 2 akan dikonversi menjadi tipe data integer

# Konversi tipe data dengan fungsi astype()

In [34]:
df_x = df.astype({'col2':'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [36]:
df_x.dtypes

col1     object
col2    float64
dtype: object

# Konversi tipe data numerik dengan fungsi to_numeric()

In [37]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [ ]:
## konversi tipe data ke tipe data numeric untuk keseluruhan colomn pada data frame